#include "temp.h"

/*********************************************************
 * 函数名：delay10us
 * 函数功能：延时函数，精确延时10us(12Mhz晶振，包含函数调用与返回时间)
 * 输入：void
 * 输出：void
 ********************************************************/
void delay10us()
{
    _nop_();
    _nop_();
    _nop_();
    _nop_();
    _nop_();
    _nop_();
}

/*********************************************************
 * 函数名：delay52us
 * 函数功能：延时函数，精确延时52us(12Mhz晶振，包含函数调用与返回时间)
 * 输入：void
 * 输出：void
 ********************************************************/
void delay52us()
{
    delay10us();
    delay10us();
    delay10us();
    delay10us();
    delay10us();
}

/*********************************************************
 * 函数名：delay522us
 * 函数功能：延时函数，精确延时522us(12Mhz晶振，包含函数调用与返回时间)
 * 输入：void
 * 输出：void
 ********************************************************/
void delay522us()
{
    delay52us(); delay52us(); delay52us(); delay52us(); delay52us();
    delay52us(); delay52us(); delay52us(); delay52us(); delay52us();
}

/*********************************************************
 * 函数名：delay800ms
 * 函数功能：延时函数，精确延时800ms(12Mhz晶振，包含函数调用与返回时间)
 * 输入：void
 * 输出：void
 ********************************************************/
void delay800ms()   //误差 0us
{
    unsigned char a,b,c;
    for(c=95;c>0;c--)
        for(b=138;b>0;b--)
            for(a=29;a>0;a--);
}

/*********************************************************
 * 函数名：ds18b20init
 * 函数功能：ds18b20初始化函数
 * 输入：void
 * 输出：0/1，1表示初始化成功元件存在于电路中，0表示初始化失败元件不存在
 ********************************************************/
uchar ds18b20init()
{
    uint i = 0;
    DSPORT = 0;//ds18b20数据线拉低
    delay522us();
    DSPORT = 1;//ds18b20数据线拉高
    while (DSPORT) {
        delay522us();
        i++;
        if (i > 8) {
            return 0;
        }
    }
    return 1;
}

/*********************************************************
 * 函数名：ds18b20writebyte
 * 函数功能：ds18b20写字节(先写低位)
 * 输入：uchar dat
 * 输出：void
 ********************************************************/
void ds18b20writebyte(uchar dat)
{
    uchar i;
    for (i = 0; i < 8; i++) {
        DSPORT = 0;//数据线拉低
        delay10us();//延时15us左右
        DSPORT = dat & 0x01;//&操作，将dat最后一位送入DAPORT
        delay52us();
        delay10us();//延时60us左右
        DSPORT = 1;//数据线拉高
        dat >>= 1;//dat移位（高位向低位移动），等待下次循环
    }
}

/*********************************************************
 * 函数名：ds18b20readbyte
 * 函数功能：ds18b20读字节(先读低位)
 * 输入：void
 * 输出：uchar
 ********************************************************/
uchar ds18b20readbyte()
{
    uint i;
    uchar byte, bi;
    for (i = 0; i < 8; i++) {
        DSPORT = 0;//数据线拉低
        _nop_();//延时1us
        _nop_();//延时1us
        DSPORT = 1;//数据线拉高
        delay10us();//延时10us左右
        bi = DSPORT;
        byte = (byte>>1) | (bi<<7);//数据写入，由低到高
        delay52us();
    }
    return byte;
}

/*********************************************************
 * 函数名：ds18b20tempchange
 * 函数功能：ds18b20温度转换
 * 输入：void
 * 输出：
 ********************************************************/
void ds18b20tempchange()
{
    ds18b20init();//初始化
    delay522us();
    delay522us();//延时1ms左右
    ds18b20writebyte(0xCC);//向ds18b20发送CCH指令，命令其跳过ROM
    ds18b20writebyte(0x44);//向ds18b20发送44H指令，启动ds18b20进行温度转换
    delay800ms();//延时800ms，ds18b20进行12位转换最长需要750ms(精度0.0625℃)
}

/*********************************************************
 * 函数名：ds18b20tempread
 * 函数功能：ds18b20温度读取初始化（只做了温度读取命令的下达，并没有真的去读温度）
 * 输入：
 * 输出：
 ********************************************************/
void ds18b20tempread()
{
    ds18b20init();//初始化
    delay522us();
    delay522us();//延时1ms左右
    ds18b20writebyte(0xCC);//向ds18b20发送CCH指令，命令其跳过ROM
    ds18b20writebyte(0xBE);//向ds18b20发送BEH指令，读内部RAM中2字节的温度内容
}

/*********************************************************
 * 函数名：ds18b20tempreadstart
 * 函数功能：ds18b20温度读取与数据传递
 * 输入：
 * 输出：int，注意温度可负，故用int
 ********************************************************/
int ds18b20tempreadstart()
{
    int temp = 0;
    uchar temph,templ;
    ds18b20tempchange();
    ds18b20tempread();
    templ = ds18b20readbyte();
    temph = ds18b20readbyte();
    temp = temph;
    temp <<= 8;
    temp |= templ;
    return temp;
}
